## Pandas Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
dict = {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(data=my_data) # set the data of inside a series

0    10
1    20
2    30
dtype: int64

In [4]:
# first method of creating a serie using label list and data list
pd.Series(data=my_data, index=labels) # set the data and index inside the series

a    10
b    20
c    30
dtype: int64

In [5]:
# second method of creting a serie using numpy array as data and index as list
pd.Series(data=arr, index=labels)

a    10
b    20
c    30
dtype: int32

In [6]:
# third method of creating a serie using dictionary
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

In [7]:
serie1 = pd.Series([1, 2, 3, 4, 5], ['USA', 'Japan', 'DRC', 'Rwanda', 'Uganda'])

In [8]:
serie1

USA       1
Japan     2
DRC       3
Rwanda    4
Uganda    5
dtype: int64

In [9]:
serie2 = pd.Series([1, 3, 5, 4, 2], ['USA', 'Itali', 'DRC', 'Rwanda', 'Uganda'])

In [10]:
serie2

USA       1
Itali     3
DRC       5
Rwanda    4
Uganda    2
dtype: int64

In [11]:
# grab information from the serie
serie1['DRC']

3

In [12]:
# adding 2 series
serie1 + serie2

DRC       8.0
Itali     NaN
Japan     NaN
Rwanda    8.0
USA       2.0
Uganda    7.0
dtype: float64

## Pandas Dataframes

In [13]:
from numpy.random import randn

In [14]:
np.random.seed(101) # set the seed to get the same random number
# randn(5, 4) generate 5 rows and 4 column
df = pd.DataFrame(data=randn(5, 4), index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
# grab series of column W
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
type(df) # dataframe is a number of series that share the same index

pandas.core.frame.DataFrame

In [19]:
# another way to get a serie from dataframe
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
# get multiple sub data from a dataframe
df[['W', 'Y', 'Z']]

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001
D  0.188695 -0.933237  0.955057
E  0.190794  2.605967  0.683509

In [21]:
# adding a column (serie) in dataframe
# df['new'] = df['W'] + df['Y']
df['new'] = randn(5, 1)

In [22]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119
E  0.190794  1.978757  2.605967  0.683509 -0.134841

In [23]:
# remove a column (serie) from dataframe
df.drop('new', axis=1, inplace=True)

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
# drop a row in a dataframe
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [26]:
df.shape # that is why rows are directy take from 0 axis and columns are directy take at 1 axis

(5, 4)

In [27]:
# select row (series) in a dataframe using row name
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [28]:
# select row (series) in a dataframe using row name using row index
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [29]:
# select subset of row and column
df.loc['B', 'Y']

-0.8480769834036315

In [30]:
# select multiple subset 
df.loc[['A', 'B'], ['W', 'Z']] # select row A and B for column W and Z. The result is a dataframe

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
# condition selection
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [33]:
booldf = df > 0

In [34]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [35]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [38]:
df[df['W'] > 0] # return only row where value > 0 in the W column

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [42]:
result_df = df[df['W']>0]

In [43]:
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [46]:
df[df['W']>0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [47]:
# multiple condition selection
df[(df['X'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
# reset dataframe index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [52]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
# make it to occurent in place
df.reset_index(inplace=True)

In [58]:
new_index = 'CA NY WY OR CO'.split()

In [59]:
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [60]:
df['States'] = new_index

In [61]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [62]:
# make a column an index
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multiline Index

In [42]:
# index level
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))

In [65]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [66]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [68]:
df = pd.DataFrame(data=randn(6, 2), index=hier_index, columns=['A', 'B'])

In [69]:
df

             A         B
G1 1  0.390528  0.166905
   2  0.184502  0.807706
   3  0.072960  0.638787
G2 1  0.329646 -0.497104
   2 -0.754070 -0.943406
   3  0.484752 -0.116773

In [70]:
# grab from one index
df.loc['G1']

          A         B
1  0.390528  0.166905
2  0.184502  0.807706
3  0.072960  0.638787

In [71]:
df.loc['G1'].iloc[1]

A    0.184502
B    0.807706
Name: 2, dtype: float64

In [72]:
# check index names
df.index.names

FrozenList([None, None])

In [73]:
# rename index
df.index.names = ['Groups', 'Num']

In [74]:
df

                   A         B
Groups Num
G1     1    0.390528  0.166905
       2    0.184502  0.807706
       3    0.072960  0.638787
G2     1    0.329646 -0.497104
       2   -0.754070 -0.943406
       3    0.484752 -0.116773

In [77]:
# challenge:  grab G2 (group 2) 2 (Num) Column B
df.loc['G2'] # grad G2 (group 2)

            A         B
Num
1    0.329646 -0.497104
2   -0.754070 -0.943406
3    0.484752 -0.116773

In [78]:
df.loc['G2'].iloc[2] # grab G2 (group 2) number 2

A    0.484752
B   -0.116773
Name: 3, dtype: float64

In [79]:
df.loc['G2'].iloc[2]['B'] # grab G2 (group 2) number 2 column B

-0.11677331646707445

In [83]:
# get value using cross section
df.xs('G2')

            A         B
Num
1    0.329646 -0.497104
2   -0.754070 -0.943406
3    0.484752 -0.116773

In [86]:
df

                   A         B
Groups Num
G1     1    0.390528  0.166905
       2    0.184502  0.807706
       3    0.072960  0.638787
G2     1    0.329646 -0.497104
       2   -0.754070 -0.943406
       3    0.484752 -0.116773

In [87]:
# get value of group G1 Num 1 and group G2 num 1
df.xs(1, level='Num')

               A         B
Groups
G1      0.390528  0.166905
G2      0.329646 -0.497104

## Missing Data

In [89]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [91]:
df = pd.DataFrame(d)

In [92]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [95]:
# remove all row with missing value
df.dropna()

     A    B  C
0  1.0  5.0  1

In [96]:
# drop column with missing value
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [97]:
# drop row with 2 missing value
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [98]:
# fill default value to the missing value
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

## Group By

In [99]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200, 120, 340, 124, 243, 350]}

In [100]:
df = pd.DataFrame(data)

In [101]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [102]:
# grop by column
by_company = df.groupby('Company')

In [103]:
by_company.mean() # get the sales mean. It ignore Person column because it has string datatype

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [104]:
by_company.std() # get the standard deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [105]:
by_company.sum() # sum of sales

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [106]:
# select the sum of FB sales
by_company.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [107]:
# select the sum of FB sales
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [108]:
# count by company
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [109]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [110]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [111]:
# describe method
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [112]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [114]:
df.groupby('Company').describe().transpose()['MSFT'] # get for MSFT column

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64

## Merging Joining and Concatenating

In [118]:
df1 = pd.DataFrame(data = {'A': ['A0', 'A1', 'A2', 'A3'],
                  'B': ['B0', 'B1', 'B2', 'B3'],
                  'C': ['C0', 'C1', 'C2', 'C3'],
                  'D': ['D0', 'D1', 'D2', 'D3']}, index=[0, 1, 2, 3])

In [117]:
df2 = pd.DataFrame(data = {'A': ['A4', 'A5', 'A6', 'A7'],
                  'B': ['B4', 'B5', 'B6', 'B7'],
                  'C': ['C4', 'C5', 'C6', 'C7'],
                  'D': ['D4', 'D5', 'D6', 'D7']}, index=[4, 5, 6, 7])

In [119]:
df3 = pd.DataFrame(data = {'A': ['A8', 'A9', 'A10', 'A11'],
                  'B': ['B8', 'B9', 'B10', 'B11'],
                  'C': ['C8', 'C9', 'C10', 'C11'],
                  'D': ['D8', 'D9', 'D10', 'D11']}, index=[8, 9, 10, 11])

In [120]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [121]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [122]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### concatenation

In [123]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [124]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [125]:
left = pd.DataFrame({'Key':['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],})

In [126]:
right = pd.DataFrame({'Key':['K0', 'K1', 'K2', 'K3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [127]:
left

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [128]:
right

  Key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

### Merge

In [130]:
pd.merge(left, right, how='inner', on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [131]:
# merge on 2 keys
left = pd.DataFrame({'Key1':['K0', 'K1', 'K2', 'K3'],
                     'Key2':['K0', 'K1', 'K0', 'K1'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],})

right = pd.DataFrame({'Key1':['K0', 'K1', 'K1', 'K0'],
                     'Key2':['K0', 'K0', 'K0', 'K0'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [132]:
pd.merge(left, right, on=['Key1', 'Key2'])

  Key1 Key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K0   K0  A0  B0  C3  D3

In [134]:
pd.merge(left, right, how='outer', on=['Key1', 'Key2'])

  Key1 Key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K0   A0   B0   C3   D3
2   K1   K1   A1   B1  NaN  NaN
3   K2   K0   A2   B2  NaN  NaN
4   K3   K1   A3   B3  NaN  NaN
5   K1   K0  NaN  NaN   C1   D1
6   K1   K0  NaN  NaN   C2   D2

In [135]:
pd.merge(left, right, how='right', on=['Key1', 'Key2'])

  Key1 Key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K0   K0   A0   B0  C3  D3
2   K1   K0  NaN  NaN  C1  D1
3   K1   K0  NaN  NaN  C2  D2

In [136]:
pd.merge(left, right, how='left', on=['Key1', 'Key2'])

  Key1 Key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K0  A0  B0   C3   D3
2   K1   K1  A1  B1  NaN  NaN
3   K2   K0  A2  B2  NaN  NaN
4   K3   K1  A3  B3  NaN  NaN

### Joining

In [137]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                    'B': ['B0', 'B1', 'B2']}, index=['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']}, index=['K0', 'K2', 'K3'])

In [138]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [139]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations

In [142]:
df = pd.DataFrame({'col1': [1, 2, 3, 4], 
                  'col2': [444, 555, 666, 444],
                  'col3': ['abc', 'def', 'ghi', 'xyz']})

In [143]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [147]:
# find unic value in the dataframe
df['col2'].nunique() # return unique value in column 2

array([444, 555, 666], dtype=int64)

In [146]:
df['col2'].nunique() # return number of unique value in column 2

3

In [149]:
# value count
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [153]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [154]:
def times2(x):
    return x*2

In [156]:
df['col2'].apply(times2) # apply your customer function to dataframe

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [158]:
df['col3'].apply(len) # apply build function to dataframe

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [159]:
# combine lamda expression to a dataframe
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [160]:
# remove column
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [163]:
df.columns # get the columns name

Index(['col1', 'col2', 'col3'], dtype='object')

In [164]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [165]:
# sort dataframe
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [166]:
# find null value in dataframe
df.isnull() # return boolean dataframe

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [167]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B': ['one', 'one', 'two', 'two', 'one', 'one'],
       'C': ['x', 'y', 'x', 'y', 'x', 'y'],
       'D': [1, 3, 2, 5, 4, 1]}
df = pd.DataFrame(data)

In [168]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [169]:
# pivot table
df.pivot_table(values = 'D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

 ##  Data Input and Output
 * CSV
 * Excel
 * HTML
 * SQL

In [5]:
import pandas as pd

In [2]:
pwd # get the current working directory

'C:\\Users\\cris_0XC0\\Desktop\\Machine Learning Bootcamp\\03.Python for Data Analysis - Pandas'

In [6]:
pd.read_csv('example.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [7]:
# read csv file
df = pd.read_csv('example.csv')

In [17]:
# wite csv file
df.to_csv('my_output.csv', index=False) # save to my_output file but don't put the index

In [18]:
pd.read_csv('my_output.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [11]:
# read excel file
pd.read_excel('excel_sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [15]:
# write to excel file
df.to_excel('my_excel_output.xlsx', sheet_name='NewSheet', index=False)

In [16]:
pd.read_excel('my_excel_output.xlsx', sheet_name="NewSheet")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [19]:
# read html
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [20]:
type(data)

list

In [23]:
data[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [24]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [30]:
# read sql file
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:') # create a database that run in memory

In [37]:
df.to_sql('my_tables', engine, index=False) # save file to my_table

In [39]:
sqldf = pd.read_sql('my_tables', con=engine)

In [40]:
sqldf

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15